artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: '/posts'
          json:
            title: 'Test'
            category: 'artillery test'
            post: 'take that'
      - get:
          url: '/posts'